nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
#include "stn1110.h"
#include "stm32f4xx_hal.h"
#include "usart.h"

//UART_HandleTypeDef huart6;

/*
 bool STN1110::begin(Stream &stream, const bool& debug, const uint16_t& timeout, const char& protocol, const uint16_t& payloadLen)

 Description:
 ------------
  * Constructor for the ELM327 Class; initializes ELM327

 Inputs:
 -------
  * Stream &stream      - Pointer to Serial port connected to ELM327
  * bool debug          - Specify whether or not to print debug statements to "Serial"
  * uint16_t timeout    - Time in ms to wait for a query response
  * char protocol       - Protocol ID to specify the ELM327 to communicate with the ECU over
  * uint16_t payloadLen - Maximum number of bytes expected to be returned by the ELM327 after a query

 Return:
 -------
  * bool - Whether or not the ELM327 was propperly
  initialized
*/
bool STN1110::begin(UART_HandleTypeDef *STN_PORT, const bool& debug, const uint16_t& timeout, const char& protocol, const uint16_t& payloadLen)
{
	stn_port	= STN_PORT;
	PAYLOAD_LEN = payloadLen;
	debugMode   = debug;
	timeout_ms  = timeout;

	payload = (char*)malloc(PAYLOAD_LEN + 1); // allow for terminating '\0'

	// test if serial port is connected
	if (HAL_UART_Init(stn_port) != HAL_OK)
		{
		printf("Failed to initiate stn_port\r\n");
		return false;
		}

	// try to connect
	if (!initializeELM(protocol))
	{
		printf("Failed to initiate\r\n");
		return false;
	}

	return true;
}




/*
 bool STN1110::initializeELM(const char& protocol)

 Description:
 ------------
  * Initializes ELM327

 Inputs:
 -------
  * char protocol - Protocol ID to specify the ELM327 to communicate with the ECU over

 Return:
 -------
  * bool - Whether or not the ELM327 was propperly initialized

 Notes:
 ------
  * Protocol - Description
  * 0        - Automatic
  * 1        - SAE J1850 PWM (41.6 kbaud)
  * 2        - SAE J1850 PWM (10.4 kbaud)
  * 3        - ISO 9141-2 (5 baud init)
  * 4        - ISO 14230-4 KWP (5 baud init)
  * 5        - ISO 14230-4 KWP (fast init)
  * 6        - ISO 15765-4 CAN (11 bit ID, 500 kbaud)
  * 7        - ISO 15765-4 CAN (29 bit ID, 500 kbaud)
  * 8        - ISO 15765-4 CAN (11 bit ID, 250 kbaud)
  * 9        - ISO 15765-4 CAN (29 bit ID, 250 kbaud)
  * A        - SAE J1939 CAN (29 bit ID, 250* kbaud)
  * B        - User1 CAN (11* bit ID, 125* kbaud)
  * C        - User2 CAN (11* bit ID, 50* kbaud)

  * --> *user adjustable
*/
bool STN1110::initializeELM(const char& protocol)
{


	char command[10] = { '\0' };
	connected = false;

	sendCommand(SET_ALL_TO_DEFAULTS);
	delay(100);

	sendCommand(RESET_ALL);
	delay(100);

	sendCommand(ECHO_OFF);
	delay(100);

	sendCommand(PRINTING_SPACES_OFF);
	delay(100);

	sendCommand(ALLOW_LONG_MESSAGES);
	delay(100);

	// Set protocol
	sprintf(command, TRY_PROT_H_AUTO_SEARCH, protocol);

	if (sendCommand(command) == ELM_SUCCESS)
	{
		if (strstr(payload, "OK") != NULL)
		{
			connected = true;
			return connected;
		}
	}

	if (debugMode)
	{
		printf("Setting protocol via ");
		printf("%s\r\n", TRY_PROT_H_AUTO_SEARCH);
		printf(" did not work - trying via ");
		printf("%s\r\n", SET_PROTOCOL_TO_H_SAVE);
	}
	
	// Set protocol and save
	sprintf(command, SET_PROTOCOL_TO_H_SAVE, protocol);

    if (sendCommand(command) == ELM_SUCCESS)
    {
    	if (strstr(payload, "OK") != NULL)
    	{
    		connected = true;
    	}
    }

	if (debugMode)
	{
		printf("Setting protocol via ");
		printf("%s", SET_PROTOCOL_TO_H_SAVE);
		printf(" did not work\r\n");
	}

	return connected;
}




/*
 void STN1110::formatQueryArray(uint8_t service, uint16_t pid)

 Description:
 ------------
  * Creates a query stack to be sent to ELM327

 Inputs:
 -------
  * uint16_t service - Service number of the queried PID
  * uint32_t pid     - PID number of the queried PID

 Return:
 -------
  * void
*/
void STN1110::formatQueryArray(uint8_t service, uint16_t pid)
{
	if (debugMode)
	{
		printf("Service: ");
		printf("%u\r\n", service);
		printf("PID: ");
		printf("%u\r\n", pid);
	}

	query[0] = ((service >> 4) & 0xF) + '0';
	query[1] = (service & 0xF) + '0';

	// determine PID length (standard queries have 16-bit PIDs,
	// but some custom queries have PIDs with 32-bit values)
	if (pid & 0xFF00)
	{
		if (debugMode)
			printf("Long query detected\r\n");

		longQuery = true;

		query[2] = ((pid >> 12) & 0xF) + '0';
		query[3] = ((pid >> 8) & 0xF) + '0';
		query[4] = ((pid >> 4) & 0xF) + '0';
		query[5] = (pid & 0xF) + '0';

		upper(query, 6);
	}
	else
	{
		if (debugMode)
			printf("Normal length query detected\r\n");

		longQuery = false;

		query[2] = ((pid >> 4) & 0xF) + '0';
		query[3] = (pid & 0xF) + '0';
		query[4] = '\0';
		query[5] = '\0';

		upper(query, 4);
	}

	if (debugMode)
	{
		printf("Query string: ");
		printf("%s\r\n", query);
	}
}




/*
 void STN1110::upper(char string[], uint8_t buflen)

 Description:
 ------------
  * Converts all elements of char array string[] to
  uppercase ascii

 Inputs:
 -------
  * uint8_t string[] - Char array
  * uint8_t buflen   - Length of char array

 Return:
 -------
  * void
*/
void STN1110::upper(char string[], uint8_t buflen)
{
	for (uint8_t i = 0; i < buflen; i++)
	{
		if (string[i] > 'Z')
			string[i] -= 32;
		else if ((string[i] > '9') && (string[i] < 'A'))
			string[i] += 7;
	}
}




/*
 bool STN1110::timeout()

 Description:
 ------------
  * Determines if a time-out has occurred

 Inputs:
 -------
  * void

 Return:
 -------
  * bool - whether or not a time-out has occurred
*/
bool STN1110::timeout()
{
	currentTime = millis();
	if ((currentTime - previousTime) >= timeout_ms)
		return true;
	return false;
}




/*
 uint8_t STN1110::ctoi(uint8_t value)

 Description:
 ------------
  * converts a decimal or hex char to an int

 Inputs:
 -------
  * uint8_t value - char to be converted

 Return:
 -------
  * uint8_t - int value of parameter "value"
*/
uint8_t STN1110::ctoi(uint8_t value)
{
	if (value >= 'A')
		return value - 'A' + 10;
	else
		return value - '0';
}




/*
 int8_t STN1110::nextIndex(char const *str,
                          char const *target,
                          uint8_t numOccur)

 Description:
 ------------
  * Finds and returns the first char index of
  numOccur'th instance of target in str

