nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
 Inputs:
 -------
  * char const *str    - string to search target within
  * char const *target - String to search for in str
  * uint8_t numOccur   - Which instance of target in str
  
 Return:
 -------
  * int8_t - First char index of numOccur'th
  instance of target in str. -1 if there is no
  numOccur'th instance of target in str
*/
int8_t STN1110::nextIndex(char const *str,
                         char const *target,
                         uint8_t numOccur=1)
{
	char const *p = str;
	char const *r = str;
	uint8_t count;

	for (count = 0; ; ++count)
	{
		p = strstr(p, target);

		if (count == (numOccur - 1))
			break;

		if (!p)
			break;

		p++;
	}

	if (!p)
		return -1;

	return p - r;
}




float STN1110::conditionResponse(const uint64_t& response, const uint8_t& numExpectedBytes, const float& scaleFactor, const float& bias)
{
	return ((response >> (((numPayChars / 2) - numExpectedBytes) * 8)) * scaleFactor) + bias;
}




/*
 void STN1110::flushInputBuff()

 Description:
 ------------
  * Flushes input serial buffer

 Inputs:
 -------
  * void

 Return:
 -------
  * void
*/
void STN1110::flushInputBuff()
{
	if (debugMode)
		printf("Clearing input serial Ring buffer\r\n");

	delimiter_found();
}




/*
 bool STN1110::queryPID(uint8_t service,
                       uint16_t PID,
                       float  &value)

 Description:
 ------------
  * Queries ELM327 for a specific type of vehicle telemetry data

 Inputs:
 -------
  * uint8_t service - Service number
  * uint8_t PID     - PID number

 Return:
 -------
  * bool - Whether or not the query was submitted successfully
*/
bool STN1110::queryPID(uint8_t service,
                      uint16_t pid)
{
	formatQueryArray(service, pid);
	sendCommand(query);
	
	return connected;
}




/*
 bool STN1110::queryPID(char queryStr[])

 Description:
 ------------
  * Queries ELM327 for a specific type of vehicle telemetry data

 Inputs:
 -------
  * char queryStr[] - Query string (service and PID)

 Return:
 -------
  * bool - Whether or not the query was submitted successfully
*/
bool STN1110::queryPID(char queryStr[])
{
	if (strlen(queryStr) <= 4)
		longQuery = false;
	else
		longQuery = true;

	sendCommand(queryStr);
	
	return connected;
}




/*
 uint32_t STN1110::supportedPIDs_1_20()

 Description:
 ------------
  * Determine which of PIDs 0x1 through 0x20 are supported (bit encoded)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint32_t - Bit encoded booleans of supported PIDs 0x1-0x20
*/
uint32_t STN1110::supportedPIDs_1_20()
{
	if (queryPID(SERVICE_01, SUPPORTED_PIDS_1_20))
		return conditionResponse(findResponse(), 4);

	return ELM_GENERAL_ERROR;
}




/*
 uint32_t STN1110::monitorStatus()

 Description:
 ------------
  * Monitor status since DTCs cleared (Includes malfunction indicator
  lamp (MIL) status and number of DTCs). See https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_01
  for more info

 Inputs:
 -------
  * void

 Return:
 -------
  * uint32_t - Bit encoded status (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_01)
*/
uint32_t STN1110::monitorStatus()
{
	if (queryPID(SERVICE_01, MONITOR_STATUS_SINCE_DTC_CLEARED))
		return conditionResponse(findResponse(), 4);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::freezeDTC()

 Description:
 ------------
  * Freeze DTC - see https://www.samarins.com/diagnose/freeze-frame.html for more info

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Various vehicle information (https://www.samarins.com/diagnose/freeze-frame.html)
*/
uint16_t STN1110::freezeDTC()
{
	if (queryPID(SERVICE_01, FREEZE_DTC))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::fuelSystemStatus()

 Description:
 ------------
  * Freeze DTC - see https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_03 for more info

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Bit encoded status (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_03)
*/
uint16_t STN1110::fuelSystemStatus()
{
	if (queryPID(SERVICE_01, FUEL_SYSTEM_STATUS))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::engineLoad()

 Description:
 ------------
  * Find the current engine load in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Engine load %
*/
float STN1110::engineLoad()
{
	if (queryPID(SERVICE_01, ENGINE_LOAD))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::engineCoolantTemp()

 Description:
 ------------
  * Find the current engine coolant temp in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Engine load %
*/
float STN1110::engineCoolantTemp()
{
	if (queryPID(SERVICE_01, ENGINE_COOLANT_TEMP))
		return conditionResponse(findResponse(), 1, 1, -40.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::shortTermFuelTrimBank_1()

 Description:
 ------------
  * Find fuel trim %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel trim %
*/
float STN1110::shortTermFuelTrimBank_1()
{
	if (queryPID(SERVICE_01, SHORT_TERM_FUEL_TRIM_BANK_1))
		return conditionResponse(findResponse(), 1, 100.0 / 128.0, -100.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::longTermFuelTrimBank_1()

 Description:
 ------------
  * Find fuel trim %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel trim %
*/
float STN1110::longTermFuelTrimBank_1()
{
	if (queryPID(SERVICE_01, LONG_TERM_FUEL_TRIM_BANK_1))
		return conditionResponse(findResponse(), 1, 100.0 / 128.0, -100.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::shortTermFuelTrimBank_2()

 Description:
 ------------
  * Find fuel trim %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel trim %
*/
float STN1110::shortTermFuelTrimBank_2()
{
	if (queryPID(SERVICE_01, SHORT_TERM_FUEL_TRIM_BANK_2))
		return conditionResponse(findResponse(), 1, 100.0 / 128.0, -100.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::longTermFuelTrimBank_2()

 Description:
 ------------
  * Find fuel trim %

