nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel trim %
*/
float STN1110::longTermFuelTrimBank_2()
{
	if (queryPID(SERVICE_01, LONG_TERM_FUEL_TRIM_BANK_2))
		return conditionResponse(findResponse(), 1, 100.0 / 128.0, -100.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::fuelPressure()

 Description:
 ------------
  * Find fuel pressure in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel pressure in kPa
*/
float STN1110::fuelPressure()
{
	if (queryPID(SERVICE_01, FUEL_PRESSURE))
		return conditionResponse(findResponse(), 1, 3.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::manifoldPressure()

 Description:
 ------------
  * Find intake manifold absolute pressure in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Intake manifold absolute pressure in kPa
*/
uint8_t STN1110::manifoldPressure()
{
	if (queryPID(SERVICE_01, INTAKE_MANIFOLD_ABS_PRESSURE))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::rpm()

 Description:
 ------------
  * Queries and parses received message for/returns vehicle RMP data

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Vehicle RPM
*/
float STN1110::rpm()
{
	if (queryPID(SERVICE_01, ENGINE_RPM))
		return conditionResponse(findResponse(), 2, 1.0 / 4.0);

	return ELM_GENERAL_ERROR;
}




/*
 int32_t STN1110::kph()

 Description:
 ------------
  *  Queries and parses received message for/returns vehicle speed data (kph)

 Inputs:
 -------
  * void

 Return:
 -------
  * int32_t - Vehicle speed in kph
*/
int32_t STN1110::kph()
{
	if (queryPID(SERVICE_01, VEHICLE_SPEED))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::mph()

 Description:
 ------------
  *  Queries and parses received message for/returns vehicle speed data (mph)

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Vehicle speed in mph
*/
float STN1110::mph()
{
	float mph = kph();

	if (status == ELM_SUCCESS)
		return mph * KPH_MPH_CONVERT;

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::timingAdvance()

 Description:
 ------------
  *  Find timing advance in degrees before Top Dead Center (TDC)

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Timing advance in degrees before Top Dead Center (TDC)
*/
float STN1110::timingAdvance()
{
	if (queryPID(SERVICE_01, TIMING_ADVANCE))
		return conditionResponse(findResponse(), 1, 1.0 / 2.0, -64.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::intakeAirTemp()

 Description:
 ------------
  *  Find intake air temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Intake air temperature in C
*/
float STN1110::intakeAirTemp()
{
	if (queryPID(SERVICE_01, INTAKE_AIR_TEMP))
		return conditionResponse(findResponse(), 1, 1, -40.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::mafRate()

 Description:
 ------------
  *  Find mass air flow sensor (MAF) air flow rate rate in g/s

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Mass air flow sensor (MAF) air flow rate rate in g/s
*/
float STN1110::mafRate()
{
	if (queryPID(SERVICE_01, MAF_FLOW_RATE))
		return conditionResponse(findResponse(), 2, 1.0 / 100.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::throttle()

 Description:
 ------------
  *  Find throttle position in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Throttle position in %
*/
float STN1110::throttle()
{
	if (queryPID(SERVICE_01, THROTTLE_POSITION))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::commandedSecAirStatus()

 Description:
 ------------
  *  Find commanded secondary air status

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Bit encoded status (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_12)
*/
uint8_t STN1110::commandedSecAirStatus()
{
	if (queryPID(SERVICE_01, COMMANDED_SECONDARY_AIR_STATUS))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::oxygenSensorsPresent_2banks()

 Description:
 ------------
  *  Find which oxygen sensors are present ([A0..A3] == Bank 1, Sensors 1-4. [A4..A7] == Bank 2...)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Bit encoded
*/
uint8_t STN1110::oxygenSensorsPresent_2banks()
{
	if (queryPID(SERVICE_01, OXYGEN_SENSORS_PRESENT_2_BANKS))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::obdStandards()

 Description:
 ------------
  *  Find the OBD standards this vehicle conforms to (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_1C)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Bit encoded (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_1C)
*/
uint8_t STN1110::obdStandards()
{
	if (queryPID(SERVICE_01, OBD_STANDARDS))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::oxygenSensorsPresent_4banks()

 Description:
 ------------
  *  Find which oxygen sensors are present (Similar to PID 13, but [A0..A7] == [B1S1, B1S2, B2S1, B2S2, B3S1, B3S2, B4S1, B4S2])

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Bit encoded
*/
uint8_t STN1110::oxygenSensorsPresent_4banks()
{
	if (queryPID(SERVICE_01, OXYGEN_SENSORS_PRESENT_4_BANKS))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 bool STN1110::auxInputStatus()

 Description:
 ------------
  *  Find Power Take Off (PTO) status
  
 Inputs:
 -------
  * void

 Return:
 -------
  * bool - Power Take Off (PTO) status
*/
bool STN1110::auxInputStatus()
{
	if (queryPID(SERVICE_01, AUX_INPUT_STATUS))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::runTime()

 Description:
 ------------
  *  Find run time since engine start in s

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Run time since engine start in s
*/
uint16_t STN1110::runTime()
{
	if (queryPID(SERVICE_01, RUN_TIME_SINCE_ENGINE_START))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




