nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
/*
 uint32_t STN1110::supportedPIDs_21_40()

 Description:
 ------------
  * Determine which of PIDs 0x1 through 0x20 are supported (bit encoded)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint32_t - Bit encoded booleans of supported PIDs 0x21-0x20
*/
uint32_t STN1110::supportedPIDs_21_40()
{
	if (queryPID(SERVICE_01, SUPPORTED_PIDS_21_40))
		return conditionResponse(findResponse(), 4);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::distTravelWithMIL()

 Description:
 ------------
  *  Find distance traveled with malfunction indicator lamp (MIL) on in km

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Distance traveled with malfunction indicator lamp (MIL) on in km
*/
uint16_t STN1110::distTravelWithMIL()
{
	if (queryPID(SERVICE_01, DISTANCE_TRAVELED_WITH_MIL_ON))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::fuelRailPressure()

 Description:
 ------------
  *  Find fuel Rail Pressure (relative to manifold vacuum) in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel Rail Pressure (relative to manifold vacuum) in kPa
*/
float STN1110::fuelRailPressure()
{
	if (queryPID(SERVICE_01, FUEL_RAIL_PRESSURE))
		return conditionResponse(findResponse(), 2, 0.079);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::fuelRailGuagePressure()

 Description:
 ------------
  *  Find fuel Rail Gauge Pressure (diesel, or gasoline direct injection) in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel Rail Gauge Pressure (diesel, or gasoline direct injection) in kPa
*/
float STN1110::fuelRailGuagePressure()
{
	if (queryPID(SERVICE_01, FUEL_RAIL_GUAGE_PRESSURE))
		return conditionResponse(findResponse(), 2, 10.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::commandedEGR()

 Description:
 ------------
  *  Find commanded Exhaust Gas Recirculation (EGR) in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Commanded Exhaust Gas Recirculation (EGR) in %
*/
float STN1110::commandedEGR()
{
	if (queryPID(SERVICE_01, COMMANDED_EGR))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::egrError()

 Description:
 ------------
  *  Find Exhaust Gas Recirculation (EGR) error in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Exhaust Gas Recirculation (EGR) error in %
*/
float STN1110::egrError()
{
	if (queryPID(SERVICE_01, EGR_ERROR))
		return conditionResponse(findResponse(), 1, 100.0 / 128.0, -100);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::commandedEvapPurge()

 Description:
 ------------
  *  Find commanded evaporative purge in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Commanded evaporative purge in %
*/
float STN1110::commandedEvapPurge()
{
	if (queryPID(SERVICE_01, COMMANDED_EVAPORATIVE_PURGE))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::fuelLevel()

 Description:
 ------------
  *  Find fuel tank level input in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel tank level input in %
*/
float STN1110::fuelLevel()
{
	if (queryPID(SERVICE_01, FUEL_TANK_LEVEL_INPUT))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::warmUpsSinceCodesCleared()

 Description:
 ------------
  *  Find num warm-ups since codes cleared

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Num warm-ups since codes cleared
*/
uint8_t STN1110::warmUpsSinceCodesCleared()
{
	if (queryPID(SERVICE_01, WARM_UPS_SINCE_CODES_CLEARED))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::distSinceCodesCleared()

 Description:
 ------------
  *  Find distance traveled since codes cleared in km

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Distance traveled since codes cleared in km
*/
uint16_t STN1110::distSinceCodesCleared()
{
	if (queryPID(SERVICE_01, DIST_TRAV_SINCE_CODES_CLEARED))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::evapSysVapPressure()

 Description:
 ------------
  *  Find evap. system vapor pressure in Pa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Evap. system vapor pressure in Pa
*/
float STN1110::evapSysVapPressure()
{
	if (queryPID(SERVICE_01, EVAP_SYSTEM_VAPOR_PRESSURE))
		return conditionResponse(findResponse(), 2, 1.0 / 4.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::absBaroPressure()

 Description:
 ------------
  *  Find absolute barometric pressure in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Absolute barometric pressure in kPa
*/
uint8_t STN1110::absBaroPressure()
{
	if (queryPID(SERVICE_01, ABS_BAROMETRIC_PRESSURE))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::catTempB1S1()

 Description:
 ------------
  *  Find catalyst temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Catalyst temperature in C
*/
float STN1110::catTempB1S1()
{
	if (queryPID(SERVICE_01, CATALYST_TEMP_BANK_1_SENSOR_1))
		return conditionResponse(findResponse(), 2, 1.0 / 10.0, -40.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::catTempB2S1()

 Description:
 ------------
  *  Find catalyst temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Catalyst temperature in C
*/
float STN1110::catTempB2S1()
{
	if (queryPID(SERVICE_01, CATALYST_TEMP_BANK_2_SENSOR_1))
		return conditionResponse(findResponse(), 2, 1.0 / 10.0, -40.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::catTempB1S2()

 Description:
 ------------
  *  Find catalyst temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Catalyst temperature in C
*/
float STN1110::catTempB1S2()
{
	if (queryPID(SERVICE_01, CATALYST_TEMP_BANK_1_SENSOR_2))
		return conditionResponse(findResponse(), 2, 1.0 / 10.0, -40.0);

	return ELM_GENERAL_ERROR;
}




