nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
/*
 float STN1110::catTempB2S2()

 Description:
 ------------
  *  Find catalyst temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Catalyst temperature in C
*/
float STN1110::catTempB2S2()
{
	if (queryPID(SERVICE_01, CATALYST_TEMP_BANK_2_SENSOR_2))
		return conditionResponse(findResponse(), 2, 1.0 / 10.0, -40.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint32_t STN1110::supportedPIDs_41_60()

 Description:
 ------------
  * Determine which of PIDs 0x41 through 0x60 are supported (bit encoded)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint32_t - Bit encoded booleans of supported PIDs 0x41-0x60
*/
uint32_t STN1110::supportedPIDs_41_60()
{
	if (queryPID(SERVICE_01, SUPPORTED_PIDS_41_60))
		return conditionResponse(findResponse(), 4);

	return ELM_GENERAL_ERROR;
}




/*
 uint32_t STN1110::monitorDriveCycleStatus()

 Description:
 ------------
  *  Find status this drive cycle (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_41)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint32_t - Bit encoded status (https://en.wikipedia.org/wiki/OBD-II_PIDs#Service_01_PID_41)
*/
uint32_t STN1110::monitorDriveCycleStatus()
{
	if (queryPID(SERVICE_01, MONITOR_STATUS_THIS_DRIVE_CYCLE))
		return conditionResponse(findResponse(), 4);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::ctrlModVoltage()

 Description:
 ------------
  *  Find control module voltage in V

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Control module voltage in V
*/
float STN1110::ctrlModVoltage()
{
	if (queryPID(SERVICE_01, CONTROL_MODULE_VOLTAGE))
		return conditionResponse(findResponse(), 2, 1.0 / 1000.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absLoad()

 Description:
 ------------
  *  Find absolute load value in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute load value in %
*/
float STN1110::absLoad()
{
	if (queryPID(SERVICE_01, ABS_LOAD_VALUE))
		return conditionResponse(findResponse(), 2, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::commandedAirFuelRatio()

 Description:
 ------------
  *  Find commanded air-fuel equivalence ratio

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Commanded air-fuel equivalence ratio
*/
float STN1110::commandedAirFuelRatio()
{
	if (queryPID(SERVICE_01, FUEL_AIR_COMMANDED_EQUIV_RATIO))
		return conditionResponse(findResponse(), 2, 2.0 / 65536.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::relativeThrottle()

 Description:
 ------------
  *  Find relative throttle position in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Relative throttle position in %
*/
float STN1110::relativeThrottle()
{
	if (queryPID(SERVICE_01, RELATIVE_THROTTLE_POSITION))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::ambientAirTemp()

 Description:
 ------------
  *  Find ambient air temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Ambient air temperature in C
*/
float STN1110::ambientAirTemp()
{
	if (queryPID(SERVICE_01, AMBIENT_AIR_TEMP))
		return conditionResponse(findResponse(), 1, 1, -40);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absThrottlePosB()

 Description:
 ------------
  *  Find absolute throttle position B in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute throttle position B in %
*/
float STN1110::absThrottlePosB()
{
	if (queryPID(SERVICE_01, ABS_THROTTLE_POSITION_B))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absThrottlePosC()

 Description:
 ------------
  *  Find absolute throttle position C in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute throttle position C in %
*/
float STN1110::absThrottlePosC()
{
	if (queryPID(SERVICE_01, ABS_THROTTLE_POSITION_C))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absThrottlePosD()

 Description:
 ------------
  *  Find absolute throttle position D in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute throttle position D in %
*/
float STN1110::absThrottlePosD()
{
	if (queryPID(SERVICE_01, ABS_THROTTLE_POSITION_D))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absThrottlePosE()

 Description:
 ------------
  *  Find absolute throttle position E in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute throttle position E in %
*/
float STN1110::absThrottlePosE()
{
	if (queryPID(SERVICE_01, ABS_THROTTLE_POSITION_E))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absThrottlePosF()

 Description:
 ------------
  *  Find absolute throttle position F in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute throttle position F in %
*/
float STN1110::absThrottlePosF()
{
	if (queryPID(SERVICE_01, ABS_THROTTLE_POSITION_F))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::commandedThrottleActuator()

 Description:
 ------------
  *  Find commanded throttle actuator in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Commanded throttle actuator in %
*/
float STN1110::commandedThrottleActuator()
{
	if (queryPID(SERVICE_01, COMMANDED_THROTTLE_ACTUATOR))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::timeRunWithMIL()

 Description:
 ------------
  *  Find time run with MIL on in min

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Time run with MIL on in min
*/
uint16_t STN1110::timeRunWithMIL()
{
	if (queryPID(SERVICE_01, TIME_RUN_WITH_MIL_ON))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::timeSinceCodesCleared()

 Description:
 ------------
  *  Find time since trouble codes cleared in min

