nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Time since trouble codes cleared in min
*/
uint16_t STN1110::timeSinceCodesCleared()
{
	if (queryPID(SERVICE_01, TIME_SINCE_CODES_CLEARED))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::maxMafRate()

 Description:
 ------------
  *  Find maximum value for air flow rate from mass air flow sensor in g/s

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Maximum value for air flow rate from mass air flow sensor in g/s
*/
float STN1110::maxMafRate()
{
	if (queryPID(SERVICE_01, MAX_MAF_RATE))
		return conditionResponse(findResponse(), 1, 10.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::fuelType()

 Description:
 ------------
  *  Find fuel type (https://en.wikipedia.org/wiki/OBD-II_PIDs#Fuel_Type_Coding)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Bit encoded (https://en.wikipedia.org/wiki/OBD-II_PIDs#Fuel_Type_Coding)
*/
uint8_t STN1110::fuelType()
{
	if (queryPID(SERVICE_01, FUEL_TYPE))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::ethonolPercent()

 Description:
 ------------
  *  Find ethanol fuel in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Ethanol fuel in %
*/
float STN1110::ethonolPercent()
{
	if (queryPID(SERVICE_01, ETHONOL_FUEL_PERCENT))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absEvapSysVapPressure()

 Description:
 ------------
  *  Find absolute evap. system vapor pressure in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Absolute evap. system vapor pressure in kPa
*/
float STN1110::absEvapSysVapPressure()
{
	if (queryPID(SERVICE_01, ABS_EVAP_SYS_VAPOR_PRESSURE))
		return conditionResponse(findResponse(), 2, 1.0 / 200.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::evapSysVapPressure2()

 Description:
 ------------
  *  Find evap. system vapor pressure in Pa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Evap. system vapor pressure in Pa
*/
float STN1110::evapSysVapPressure2()
{
	if (queryPID(SERVICE_01, EVAP_SYS_VAPOR_PRESSURE))
		return conditionResponse(findResponse(), 2, 1, -32767);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::absFuelRailPressure()

 Description:
 ------------
  *  Find absolute fuel rail pressure in kPa

 Inputs:
 -------
  * void

 Return:
 -------
  * float - absolute fuel rail pressure in kPa
*/
float STN1110::absFuelRailPressure()
{
	if (queryPID(SERVICE_01, FUEL_RAIL_ABS_PRESSURE))
		return conditionResponse(findResponse(), 2, 10.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::relativePedalPos()

 Description:
 ------------
  *  Find relative accelerator pedal position in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Relative accelerator pedal position in %
*/
float STN1110::relativePedalPos()
{
	if (queryPID(SERVICE_01, RELATIVE_ACCELERATOR_PEDAL_POS))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::hybridBatLife()

 Description:
 ------------
  *  Find hybrid battery pack remaining life in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Hybrid battery pack remaining life in %
*/
float STN1110::hybridBatLife()
{
	if (queryPID(SERVICE_01, HYBRID_BATTERY_REMAINING_LIFE))
		return conditionResponse(findResponse(), 1, 100.0 / 255.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::oilTemp()

 Description:
 ------------
  *  Find engine oil temperature in C

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Engine oil temperature in C
*/
float STN1110::oilTemp()
{
	if (queryPID(SERVICE_01, ENGINE_OIL_TEMP))
		return conditionResponse(findResponse(), 1, 1, -40.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::fuelInjectTiming()

 Description:
 ------------
  *  Find fuel injection timing in degrees

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Fuel injection timing in degrees
*/
float STN1110::fuelInjectTiming()
{
	if (queryPID(SERVICE_01, FUEL_INJECTION_TIMING))
		return conditionResponse(findResponse(), 2, 1.0 / 128.0, -210.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::fuelRate()

 Description:
 ------------
  *  Find engine fuel rate in L/h

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Engine fuel rate in L/h
*/
float STN1110::fuelRate()
{
	if (queryPID(SERVICE_01, ENGINE_FUEL_RATE))
		return conditionResponse(findResponse(), 2, 1.0 / 20.0);

	return ELM_GENERAL_ERROR;
}




/*
 uint8_t STN1110::emissionRqmts()

 Description:
 ------------
  *  Find emission requirements to which vehicle is designed

 Inputs:
 -------
  * void

 Return:
 -------
  * uint8_t - Bit encoded (?)
*/
uint8_t STN1110::emissionRqmts()
{
	if (queryPID(SERVICE_01, EMISSION_REQUIREMENTS))
		return conditionResponse(findResponse(), 1);

	return ELM_GENERAL_ERROR;
}




/*
 uint32_t STN1110::supportedPIDs_61_80()

 Description:
 ------------
  * Determine which of PIDs 0x61 through 0x80 are supported (bit encoded)

 Inputs:
 -------
  * void

 Return:
 -------
  * uint32_t - Bit encoded booleans of supported PIDs 0x61-0x80
*/
uint32_t STN1110::supportedPIDs_61_80()
{
	if (queryPID(SERVICE_01, SUPPORTED_PIDS_61_80))
		return conditionResponse(findResponse(), 4);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::demandedTorque()

 Description:
 ------------
  *  Find driver's demanded engine torque in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Driver's demanded engine torque in %
*/
float STN1110::demandedTorque()
{
	if (queryPID(SERVICE_01, DEMANDED_ENGINE_PERCENT_TORQUE))
		return conditionResponse(findResponse(), 1, 1, -125.0);

	return ELM_GENERAL_ERROR;
}




/*
 float STN1110::torque()

 Description:
 ------------
  *  Find actual engine torque in %

 Inputs:
 -------
  * void

 Return:
 -------
  * float - Actual engine torque in %
*/
float STN1110::torque()
{
	if (queryPID(SERVICE_01, ACTUAL_ENGINE_TORQUE))
		return conditionResponse(findResponse(), 1, 1, -125.0);

	return ELM_GENERAL_ERROR;
}




