nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
/*
 uint16_t STN1110::referenceTorque()

 Description:
 ------------
  *  Find engine reference torque in Nm

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Engine reference torque in Nm
*/
uint16_t STN1110::referenceTorque()
{
	if (queryPID(SERVICE_01, ENGINE_REFERENCE_TORQUE))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}




/*
 uint16_t STN1110::auxSupported()

 Description:
 ------------
  *  Find auxiliary input/output supported

 Inputs:
 -------
  * void

 Return:
 -------
  * uint16_t - Bit encoded (?)
*/
uint16_t STN1110::auxSupported()
{
	if (queryPID(SERVICE_01, AUX_INPUT_OUTPUT_SUPPORTED))
		return conditionResponse(findResponse(), 2);

	return ELM_GENERAL_ERROR;
}

/*float ELM327 :: o2lamdasensor()
{
if (queryPID (SERVICE_01, OXYGEN_SENSOR_1_C))
return conditionResponse (findResponse (), 2, 2.0 / 65536);

return ELM_GENERAL_ERROR;
} */




/*
 int8_t STN1110::sendCommand(const char *cmd)

 Description:
 ------------
  * Sends a command/query and reads/buffers the ELM327's response

 Inputs:
 -------
  * const char *cmd - Command/query to send to ELM327

 Return:
 -------
  * int8_t - Response status
*/
int8_t STN1110::sendCommand(const char *cmd)
{
	HAL_UART_Receive_IT(stn_port, &rxData, 1);

	uint8_t counter = 0;
	connected = false;


	char txBuf[64];
	memset(txBuf, '\0', 64);
	snprintf(txBuf, 64, "%s\r", cmd);

    


	// clear payload buffer
	memset(payload, '\0', PAYLOAD_LEN + 1);

	// reset input serial buffer and number of received bytes
	recBytes = 0;
	flushInputBuff();

	if (debugMode)
	{
		printf("Sending the following command/query: ");
		printf("%s\r\n", cmd);
	}

	HAL_UART_Transmit(stn_port, (uint8_t *)txBuf, strlen(txBuf), 0xFFFF);
	HAL_Delay(1);


	// prime the timeout timer
	previousTime = millis();
	currentTime  = previousTime;

	// buffer the response of the ELM327 until either the
	// end marker is read or a timeout has occurred
    // last valid idx is PAYLOAD_LEN but want to keep on free for terminating '\0'
    // so limit counter to < PAYLOAD_LEN


	while ((counter < PAYLOAD_LEN) && !timeout())
	{

		if ( isEmpty() == 0 )
		{

			char recChar = pop();

			if (debugMode)
			{
				printf("\tReceived char: ");

				if (recChar == '\f')
					printf("\\f\r\n");
				else if (recChar == '\n')
					printf("\\n\r\n");
				else if (recChar == '\r')
					printf("\\r\r\n");
				else if (recChar == '\t')
					printf("\\t\r\n");
				else if (recChar == '\v')
					printf("\\v\r\n");
				else
					printf("%c\r\n", recChar);
			}

			if (recChar == '>')
			{
				if (debugMode)
					printf("Delimiter found\r\n");

				break;
			}
			else if (!isalnum(recChar) && (recChar != ':'))
				continue;
			
			payload[counter] = recChar;
			counter++;

		}
	}
	rxFlag = false;

	if (debugMode)
	{
		printf("All chars received: ");
		printf("%s\r\n", payload);
	}

	if (timeout())
	{
		if (debugMode)
		{
			printf("Timeout detected with overflow of ");
			printf("%lu", ((currentTime - previousTime) - timeout_ms));
			printf("ms\r\n");


		}

		status = ELM_TIMEOUT;
		return status;
	}
	
	if (nextIndex(payload, "UNABLETOCONNECT") >= 0)
	{
		if (debugMode)
			printf("ELM responded with errror \"UNABLE TO CONNECT\"\r\n");

		status = ELM_UNABLE_TO_CONNECT;
		return status;
	}

	connected = true;

	if (nextIndex(payload, "NODATA") >= 0)
	{
		if (debugMode)
			printf("ELM responded with errror \"NO DATA\"\r\n");

		status = ELM_NO_DATA;
		return status;
	}

	if (nextIndex(payload, "STOPPED") >= 0)
	{
		if (debugMode)
			printf("ELM responded with errror \"STOPPED\"\r\n");

		status = ELM_STOPPED;
		return status;
	}

	if (nextIndex(payload, "ERROR") >= 0)
	{
		if (debugMode)
			printf("ELM responded with \"ERROR\"\r\n");

		status = ELM_GENERAL_ERROR;
		return status;
	}

	// keep track of how many bytes were received in
	// the ELM327's response (not counting the
	// end-marker '>') if a valid response is found
	recBytes = counter;

	status = ELM_SUCCESS;
	return status;

}




/*
 uint64_t STN1110::findResponse()

 Description:
 ------------
  * Parses the buffered ELM327's response and returns the queried data

 Inputs:
 -------
  * void

 Return:
 -------
  * uint64_t - Query response value
*/
uint64_t STN1110::findResponse()
{
	uint8_t firstDatum = 0;
	char header[7]     = { '\0' };

	if (longQuery)
	{
		header[0] = query[0] + 4;
		header[1] = query[1];
		header[2] = query[2];
		header[3] = query[3];
		header[4] = query[4];
		header[5] = query[5];
	}
	else
	{
		header[0] = query[0] + 4;
		header[1] = query[1];
		header[2] = query[2];
		header[3] = query[3];
	}

	if (debugMode)
	{
		printf("Expected response header: ");
		printf("%s\r\n", header);
	}

	int8_t firstHeadIndex  = nextIndex(payload, header);
	int8_t secondHeadIndex = nextIndex(payload, header, 2);

	if (firstHeadIndex >= 0)
	{
		if (longQuery)
			firstDatum = firstHeadIndex + 6;
		else
			firstDatum = firstHeadIndex + 4;

		// Some ELM327s (such as my own) respond with two
		// "responses" per query. "numPayChars" represents the
		// correct number of bytes returned by the ELM327
		// regardless of how many "responses" were returned
		if (secondHeadIndex >= 0)
		{
			if (debugMode)
				printf("Double response detected\r\n");

			numPayChars = secondHeadIndex - firstDatum;
		}
		else
		{
			if (debugMode)
				printf("Single response detected\r\n");

			numPayChars = recBytes - firstDatum;
		}

		response = 0;
		for(uint8_t i = 0; i < numPayChars; i++)
		{
			uint8_t payloadIndex = firstDatum + i;
			uint8_t bitsOffset = 4 * (numPayChars - i - 1);
			response = response | (ctoi(payload[payloadIndex]) << bitsOffset);
		}

		// It is usefull to have the response bytes
		// broken-out because some PID algorithms (standard
		// and custom) require special operations for each
		// byte returned
		responseByte_0 = response & 0xFF;
		responseByte_1 = (response >> 8) & 0xFF;
		responseByte_2 = (response >> 16) & 0xFF;
		responseByte_3 = (response >> 24) & 0xFF;
		responseByte_4 = (response >> 32) & 0xFF;
		responseByte_5 = (response >> 40) & 0xFF;
		responseByte_6 = (response >> 48) & 0xFF;
		responseByte_7 = (response >> 56) & 0xFF;

		if (debugMode)
		{
			printf("64-bit response: \r\n");
			printf("\tresponseByte_0: ");
			printf("%d\r\n", responseByte_0);
			printf("\tresponseByte_1: ");
			printf("%d\r\n",responseByte_1);
			printf("\tresponseByte_2: ");
			printf("%d\r\n",responseByte_2);
			printf("\tresponseByte_3: ");
			printf("%d\r\n",responseByte_3);
			printf("\tresponseByte_4: ");
			printf("%d\r\n",responseByte_4);
			printf("\tresponseByte_5: ");
			printf("%d\r\n",responseByte_5);
			printf("\tresponseByte_6: ");
			printf("%d\r\n",responseByte_6);
			printf("\tresponseByte_7: ");
			printf("%d\r\n",responseByte_7);
		}
		
		return response;
	}

	if (debugMode)
		printf("Response not detected\r\n");

