nices0325/stm32f4-with-stn1110/DFMstn1110ELMduinocpp/Core/Src/stn1110.cpp
	return 0;
}




/*
 void STN1110::printError()

 Description:
 ------------
  * Prints appropriate error description if an error has occurred

 Inputs:
 -------
  * void

 Return:
 -------
  * void
*/
void STN1110::printError(int8_t cur_status)
{
	printf("Received: ");
	printf("%s\r\n", payload);

	if (cur_status == ELM_SUCCESS)
		printf("ELM_SUCCESS\r\n");
	else if (cur_status == ELM_NO_RESPONSE)
		printf("ERROR: ELM_NO_RESPONSE\r\n");
	else if (cur_status == ELM_BUFFER_OVERFLOW)
		printf("ERROR: ELM_BUFFER_OVERFLOW\r\n");
	else if (cur_status == ELM_UNABLE_TO_CONNECT)
		printf("ERROR: ELM_UNABLE_TO_CONNECT\r\n");
	else if (cur_status == ELM_NO_DATA)
		printf("ERROR: ELM_NO_DATA\r\n");
	else if (cur_status == ELM_STOPPED)
		printf("ERROR: ELM_STOPPED\r\n");
	else if (cur_status == ELM_TIMEOUT)
		printf("ERROR: ELM_TIMEOUT\r\n");
	else if (cur_status == ELM_TIMEOUT)
		printf("ERROR: ELM_GENERAL_ERROR\r\n");
	else
		printf("No error detected\r\n");

	delay(100);
}

void STN1110::push(uint8_t new_data)
{
	queue_buf[head] = new_data;
	head++;

	if (head >= MAX_QUEUE_SIZE) {
		head = 0;
	}
}

uint8_t STN1110::pop(void)
{
	uint8_t pop_data = queue_buf[tail];
	tail++;

	if (tail >= MAX_QUEUE_SIZE) {
		tail = 0;
	}

	return pop_data;
}

uint8_t STN1110::isEmpty(void)
{
	if ( head == tail) { return 1; }
	else return 0;
}

void STN1110::queue_init(void)
{
	head = 0;
	tail = 0;
	//Add something initialize
	memset(queue_buf, 0, sizeof(queue_buf));
}

void STN1110::delimiter_found()
{
	if (rxData == '<')
		{
		head = 0;
		tail = 0;
		memset(queue_buf, 0, sizeof(queue_buf));
		}
}
